free_shelf/app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
        <%= f.label :author %>
        <%= f.collection_select(:author_id, Author.all, :id, :name) %>