free_shelf/app/views/authors/index.html.erb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
                <td><%= a.name %></td>
                <td><% selected = @books.select { |b| b.author == a } %>