free_shelf/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def current_user
        if session[:user_id]
            @user ||= User.find(session[:user_id])