free_shelf/app/controllers/application_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "molbrown"], ["created_at", "2018-05-22 22:31:06.481376"], ["updated_at", "2018-05-22 22:31:06.481376"]]
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "molbrown"], ["LIMIT", 1]]
---
    def current_user
        @current_user = User.find_or_create_by(username: "molbrown")