free_shelf/app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors" ORDER BY name ASC
SELECT "books".* FROM "books" ORDER BY title ASC
---
    def index
        @authors = Author.all
        @books = Book.all

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Molly Brown"], ["created_at", "2018-05-22 14:22:15.906281"], ["updated_at", "2018-05-22 14:22:15.906281"]]
---
    def create
        @author = Author.new(author_params)
        if @author.save

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    def edit
        @author = Author.find(params[:id])

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    def update
        @author = Author.find(params[:id])