free_shelf/app/controllers/books_controller.rb

    def index
        @books = Book.all
---
SELECT "books".* FROM "books" ORDER BY language ASC, title ASC

    def create
        @book = Book.new(book_params)
        if @book.save
---
INSERT INTO "books" ("author_id", "title", "description", "url", "language", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
        @book = Book.find(params[:id])

        if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Developing Games With Ruby"], ["updated_at", "2018-05-23 03:15:35.487492"], ["id", 5]]