free_shelf/app/controllers/checkouts_controller.rb

SELECT  "checkouts".* FROM "checkouts" LIMIT $1  [["LIMIT", 1]]
---
def index
    @checkouts = Checkout.all.map{ |co| co.user_id == current_user.id }

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
def new
    @checkout = Checkout.new
    @book = Book.find(params[:book_id])

INSERT INTO "checkouts" ("book_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["book_id", 2], ["user_id", 1], ["created_at", "2018-05-23 15:47:54.300487"], ["updated_at", "2018-05-23 15:47:54.300487"]]
---
def create
    @checkout = Checkout.new(checkout_params)
    if @checkout.save

SELECT  "checkouts".* FROM "checkouts" WHERE "checkouts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "checkouts" WHERE "checkouts"."id" = $1  [["id", 5]]
---
def destroy
    @checkout = Checkout.find(params[:id])
    @checkout.destroy