free_shelf/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"